app/Livewire/Shared/CajaMenor/CCMBorradores.php

    public function render()
    {

        $drafts = [];

        if($this->cargarLista){

            $drafts = CompraMenor::select('id','cm_folio','cm_fecha','cm_asunto')
                ->where('cm_creation_status','Borrador')
                ->where('solicitante_id', Auth::user()->id)
                ->where('cm_asunto','like','%'.$this->buscar.'%')
                ->orderby($this->ordenar, $this->direccion)
                ->paginate($this->mostrar);
---
select count(*) as aggregate from `compra_menor` where `cm_creation_status` = 'Borrador' and `solicitante_id` = 2 and `cm_asunto` like '%%'