app/Livewire/Shared/CajaMenor/CCMCreate.php

    public function GetActivities($value)
    {
        $this->mir4 = true;
        $this->actividades_mir = Plan4Actividad::where('plan3_componente_id', $value)->get()->toArray();
---
select * from `plan4_actividads` where `plan3_componente_id` = '3'