app/Livewire/Shared/Solicitud/SolicitudesCreate.php

select * from `ppto_de_egresos`
select * from `plan1_fins`
---
        }

        $this->partida_presupuestal = '';
        $this->partidas_presupuestales = PptoDeEgreso::all();
        $this->fines_mir = Plan1Fin::all();

select * from `plan4_actividads` where `plan3_componente_id` = '2'
---
    public function GetActivities($value){
        $this->mir4 = true;
        $this->actividades_mir = Plan4Actividad::where('plan3_componente_id', $value)->get()->toArray();