app/Http/Controllers/ApiController.php

select * from `users` where `users`.`id` = 'Rol para Jefe de Control Presupuestal' limit 1
---
    public function trayAlert($user_id){
        $filtrados = [];

        $user = User::find($user_id);